УТ_для_edt.РасширениеСмарт/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3b4661-75a6-4317-9e52-a21fb3ad20b9">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64303e94-490e-4229-a86f-9d6a6769b763">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a184b1dd-510a-46f6-b38c-2a1c8ff0217a">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0038fc7e-3157-476b-824d-811a30639c88">
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="11eb9dbe-02b3-4892-b634-f243b2dfd2f1">
    <name>НаименованиеСокращенное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b153de3-87fe-4907-9e94-8556af48fda2">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="685363b5-d549-4059-81c3-83f4001dac92">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a2fdd27-2959-4e3e-9039-80e8cebcf1e2">
    <name>ОГРН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38df9827-83de-429d-a872-d44c4a5b383a">
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f17d55e6-7114-4f91-bee2-e2e64e65fa8b">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9e332fa6-d24a-436f-bac7-5e086c273763">
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33c042cb-b26c-4c0d-acac-fde61b334c1f">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d9e54389-8d99-4508-af2e-411a4520ca52">
    <name>КрупнейшийНалогоплательщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1affc249-13d0-477e-b7a9-8a2b51caeb55">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75dc325f-619e-4beb-99ba-e69da503125b">
    <name>Префикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0625e5ef-5727-4476-afca-88c6fce30fcd">
    <name>КодНалоговогоОрганаПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ecc0dbb2-ffb6-44df-9a60-571932153ea5">
    <name>ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83555d53-4331-4f0c-9a15-c46c7d8c9e73">
    <name>НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="215bcd7a-1ae8-47a8-8fab-599989e59bc9">
    <name>смартГрузоотправители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="73fa78e8-0e0d-4300-884d-53074a97228b">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a933e94-c895-4b1a-ac32-fc1443ce396f">
      <name>Грузоотправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Организации/Forms/ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&После("КонтактнаяИнформацияПриСменеСтраницы")
Процедура смарт_КонтактнаяИнформацияПриСменеСтраницы()
	////++#1012 смарт: Холопов 04.05.2022 //  Добавление подсказок для программно добавленных элементов и телефонов в КИ
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);
	////--#1012 смарт: Холопов 04.05.2022 
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ #1246 смарт: Фролов 21.11.2022 //Описание  
	//Если ЭтаФорма.Элементы.Найти("смартГруппаГрузоотправители") = Неопределено ТОгда
		ГруппаГрузоотправители = ЭтаФорма.Элементы.Вставить("смартГруппаГрузоотправители", Тип("ГруппаФормы"),ЭтаФорма.Элементы.СтраницыПараметрыОрганизации,Неопределено);
		ГруппаГрузоотправители.Вид = ВидГруппыФормы.Страница;
		ГруппаГрузоотправители.Заголовок = "Группа грузоотправители (смарт)";
				
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартУведомлениеДоступа", Тип("ДекорацияФормы"), ГруппаГрузоотправители);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Для внесения изменений в таблицу Грузоотправители, обратитесь пожалуйста к администратору 1С.";
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		НовыйЭлемент.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		НовыйЭлемент.МаксимальнаяШирина = 100;
		
		ТаблицасмартГрузоотправители = Элементы.Добавить("смартГрузоотправители", Тип("ТаблицаФормы"),ГруппаГрузоотправители);
		ТаблицасмартГрузоотправители.ПутьКДанным = "Объект.смартГрузоотправители";
		НовыйЭлемент1  = ЭтаФорма.Элементы.Добавить("смартГрузоотправителиСклад",Тип("ПолеФормы"),ТаблицасмартГрузоотправители);
		НовыйЭлемент1.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент1.ПутьКДанным = "Объект.смартГрузоотправители.Склад";
		НовыйЭлемент2  = ЭтаФорма.Элементы.Добавить("смартГрузоотправителиГрузоотправитель",Тип("ПолеФормы"),ТаблицасмартГрузоотправители);
		НовыйЭлемент2.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент2.ПутьКДанным = "Объект.смартГрузоотправители.Грузоотправитель";    
	//КонецЕсли;

	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.смартГрузоотправители.ТолькоПросмотр=Истина;
	КонецЕсли;
	//-- #1246 смарт: Фролов 21.11.2022
КонецПроцедуры
	
#КонецОбласти
